src/config/DataProcessors/БлокировкаСоединенийСИнформационнойБазой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>БлокировкаСоединенийСИнформационнойБазой</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстановитьБлокировкуСоединений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/Enums/РежимыЗавершенияРаботыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>РежимыЗавершенияРаботыПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазрешитьРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитьПриНаличииПодтвержденияПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитьПослеОжиданияПодтвержденияПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитьССохранениемДанныхПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитьБезусловно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/DataProcessors/БлокировкаСоединенийСИнформационнойБазой/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура устанавливает блокировку соединений с ИБ,
// в соответствиями со значениями реквизитов объекта.
// При установке блокировки в информационной базе включается
// механизм завершения работы пользователей (включая пользователя,
// инициировавшего блокировку).
//
Процедура УстановитьБлокировку() Экспорт	
    # Если Клиент Тогда             
        Если УстановитьБлокировкуСоединений Тогда
            // поскольку блокировка еще не установлена, то при входе в систему
            // для данного пользователя был подключен обработчик ожидания завершения работы.
            // Отключаем его. Так как для этого пользователя подключается специализированный обработчки ожидани
            // "ЗавершитьРаботуПользователей", который ориентирован на то, что данный пользователь
            // должен быть отключен последним.        
			
//-------------Оповещение не позднее 1 мин. с момента блокировки---------------			
			//в модуле приложения
			//	КонтрольРежимаЗавершенияРаботыПользователей();
			//	ПодключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей", 60); - оповещение зависит от времени входа...

//--------------Выключение через 3 мин.---------------
			Если РольДоступна("ПравоЗавершенияРаботыПользователей") тогда
				константаЗРП = Константы.РежимЗавершенияРаботыПользователей.Получить();	
				ЗапретитьРП = Перечисления.РежимыЗавершенияРаботыПользователей.ЗавершитьССохранениемДанныхПользователя;
				Если константаЗРП <> ЗапретитьРП тогда
					Константы.РежимЗавершенияРаботыПользователей.Установить(ЗапретитьРП);
				КонецЕсли;
			
				ОтключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей"); // у текущего пользователя!
				ЗавершитьРаботуПользователей();
				ПодключитьОбработчикОжидания("ЗавершитьРаботуПользователей", 60);	//+++ каждую минуту показывает сообщение, затем всех вырубит!!!
		
			иначе
				Предупреждение("У вас нет права завершать работу пользователей!",30);
				УстановитьБлокировкуСоединений = ложь;
		    КонецЕсли;
			
		иначе //включим работу!
			РазрешитьРаботу = Перечисления.РежимыЗавершенияРаботыПользователей.РазрешитьРаботу;
			Константы.РежимЗавершенияРаботыПользователей.Установить(РазрешитьРаботу);
			УстановитьМонопольныйРежим(ЛОЖЬ);
			ОтключитьОбработчикОжидания("ЗавершитьРаботуПользователей");	//+++ через 1 мин. -  всех включит!
		КонецЕсли;
    # КонецЕсли 

    
	// параметры блокировки
	Блокировка = Новый БлокировкаУстановкиСоединений;
	
	Блокировка.Начало 			= НачалоБлокировки;
	Блокировка.Конец  			= ОкончаниеБлокировки;
	Блокировка.Сообщение 		= Сообщение;
	Блокировка.Установлена 		= УстановитьБлокировкуСоединений;
	Блокировка.КодРазрешения 	= КодРазрешения;	
	// установка блокировки соединений
	Если РольДоступна("ПолныеПрава") тогда
		
		Если (УстановитьБлокировкуСоединений и РольДоступна("ПравоЗавершенияРаботыПользователей"))
			или (НЕ УстановитьБлокировкуСоединений) тогда  //снять блокировку может с Полными правами и кодом разблокировки
			
			попытка
				
				УстановитьБлокировкуУстановкиСоединений(Блокировка);
			
				Если УстановитьБлокировкуСоединений тогда
					сообщить("Блокировка базы - ВКЛючена.  Пользователям - запрещен вход в текущую базу до "+ Строка( ОкончаниеБлокировки ) +" !", СтатусСообщения.Внимание);
				иначе
					сообщить("Блокировка базы - ВЫКЛючена. Пользователям - разрешен вход в текущую базу 1С (  "+ Строка( ТекущаяДата() ) +")", СтатусСообщения.Информация);
				КонецЕсли;
				
			исключение
				сообщить("Ошибка при установки Блокировки базы : "+ ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;
		иначе
			//Если (УстановитьБлокировкуСоединений и НЕ РольДоступна("ПравоЗавершенияРаботыПользователей")) тогда
				Предупреждение("У вас нет Права завершения работы пользователей. 
			 				  |Установка блокировки - невозможна!",30);
				УстановитьБлокировкуСоединений = ложь;
		КонецЕсли;
							  
	иначе
		Предупреждение("У вас нет Полных прав в текущей базе данных 1С
					  |Изменение блокировок - недоступно!",30);
		УстановитьБлокировкуСоединений = ложь;
	КонецЕсли;
			
		
КонецПроцедуры // УстановитьБлокировку()
